src/Catalogs/ДоговорыВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДоговорыВзаиморасчетов</Name>
			<Comment>Договоры взаиморасчетов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоЗакрытиеСделок</Name>
					<Comment>Значение по умолчанию для аналогичного флага в документах, влияющего на взаиморасчеты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Comment>Валюта взаиморасчетов по договору. Значение не может быть изменено, если по договору проведен хотя бы один документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Comment>Вид договора с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания учета по договору</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала учета по договору</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГосударственногоКонтракта</Name>
					<Comment>Идентификатор государственного контракта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияОтчетНаОснованииПродаж</Name>
					<Comment>Способ расчета комиссии в отчете комитенту</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйКредит</Name>
					<Comment>Максимальная сумма кредита (долга) по договору в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Comment>Номер договора с контрагентом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПроект</Name>
					<Comment>Основной проект договора взаиморасчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаКонтроляСуммыКредита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантОтКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписанты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантОтОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписанты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссионногоВознаграждения</Name>
					<Comment>Процент комиссионного вознаграждения для договоров комиссии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПредоплаты</Name>
					<Comment>Процент предоплаты по договору</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплатыЗадолженности</Name>
					<Comment>Срок оплаты задолженности (в днях)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Comment>Статья ДДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссионногоВознаграждения</Name>
					<Comment>Сумма комиссионного вознаграждения для договоров комиссии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Comment>Тип договора</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСкидкиНаценки</Name>
					<Comment>Тип скидки (наценки) по умолчанию для оформлению продаж по данному договору</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСуммыКомиссии</Name>
					<Comment>Тип суммы комиссии: 0 - процентом,1 - фиксированной суммой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, используемый по умолчанию, при оформлении документов по договору</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиВзаиморасчеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаПлатежаЗависитОтСрокаГодности</Name>
					<Comment>Отсрочка платежа зависит от срока годности поставленных товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВБанковскихДнях</Name>
					<Comment>Считать все отстрочки в банковских днях (истина), в календарных (ложь)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентБонусногоВознаграждения</Name>
					<Comment>Процент бонусного вознаграждения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодВыплатыБонусныхВознаграждений</Name>
					<Comment>Период выплаты бонусных вознаграждений</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьАнализаНакопительныхСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНачисленияБонусов</Name>
					<Comment>Договор, на который будет происходить начисление суммы бонусов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакАгента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиАгента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапретаОтгрузкиПоДоговору</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьКурсСделки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗакрытияСделок</Name>
					<Comment>Способ закрытия сделок</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособЗакрытияСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьСогласованныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьНаличиеЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьРедактироватьЗакупочныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПродажуНижеСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСогласованнойЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПМастерКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРППризнакНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Бонусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СхемаРасчетаБонусов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипБонуса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыБонусов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура, которая попадает в Акт об оказании услуг</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыОперацийДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийДоговора</Name>
			<Comment>Виды операций договора</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Операция покупки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Операция продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренняя</Name>
					<Comment>Внутренняя операция</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ДоговорыВзаиморасчетов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Модуль формы элемента справочника "Договоры взаиморасчетов"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияОсновнойДоговор(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если РезультатОповещения = КодВозвратаДиалога.Нет Тогда
		Объект.Основной = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияОсновнойДоговор()

// Формирует наименование по умолчанию.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура СформироватьНаименованиеПоУмолчанию(ПараметрыДействия=Неопределено)
	
	УправлениеДиалогомСервер.СформироватьЗначениеПоУмолчанию(ЭтотОбъект, Объект, ПараметрыДействия);
	
КонецПроцедуры // СформироватьНаименованиеПоУмолчанию()

// Настраивает отображение и начальные значения для группы переключателей ПроцентПредоплаты
//
&НаСервере
Процедура НастроитьГруппуПроцентПредоплаты()
	
	Элементы.ПроцентПредоплатыИзНастроек.Заголовок = "Устанавливать % предоплаты из настроек пользователя ("+ПравоПользователя("МинимальныйПроцентПредоплаты", Объект)+"%)";	
	Если Объект.ПроцентПредоплаты >= 0 И ЗначениеЗаполнено(Объект.Ссылка) Тогда  
		ПроцентПредоплатыИзНастроек = 0;
		ПроцентПредоплатыВручную = 1;
		ПолеПроцентПредоплаты = Объект.ПроцентПредоплаты;
	Иначе
		ПроцентПредоплатыИзНастроек = 1;
		ПроцентПредоплатыВручную = 0;
		Объект.ПроцентПредоплаты = -1;
	КонецЕсли;
	Элементы.ПолеПроцентПредоплаты.ТолькоПросмотр = ПроцентПредоплатыИзНастроек;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомСправочникаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	// подставим параметр отбора для фильтрации типа цен
	ВидОперации = Справочники.ДоговорыВзаиморасчетов.ПолучитьВидОперации(Объект.ВидДоговора);
	
	Если Не Элементы.Найти("ТипЦен")=Неопределено Тогда
		
		УправлениеДиалогомСервер.УдалитьПараметрВыбора(Элементы.ТипЦен.ПараметрыВыбора,"Отбор.Продажа");
		УправлениеДиалогомСервер.УдалитьПараметрВыбора(Элементы.ТипЦен.ПараметрыВыбора,"Отбор.Закупка");
		
		Если ВидОперации = Перечисления.ВидыОперацийДоговора.Продажа Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(ЭтотОбъект.Элементы.ТипЦен.ПараметрыВыбора, "Отбор.Продажа", Истина);
		ИначеЕсли ВидОперации = Перечисления.ВидыОперацийДоговора.Покупка Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(ЭтотОбъект.Элементы.ТипЦен.ПараметрыВыбора, "Отбор.Закупка", Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	// устанавливаем отбор по организации или подразделению
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если Не Элементы.Найти("ПодписантОтОрганизации")=Неопределено Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.ПодписантОтОрганизации.ПараметрыВыбора, "Отбор.Организация", Объект.Организация);
		КонецЕсли;
		Если Не Элементы.Найти("ПодписантОтКонтрагента")=Неопределено Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.ПодписантОтКонтрагента.ПараметрыВыбора, "Отбор.Организация", Объект.Организация);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Объект.ПодразделениеКомпании) Тогда
		Если Не Элементы.Найти("ПодписантОтОрганизации")=Неопределено Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.ПодписантОтОрганизации.ПараметрыВыбора, "Отбор.ПодразделениеКомпании", Объект.ПодразделениеКомпании);
		КонецЕсли;
		Если Не Элементы.Найти("ПодписантОтКонтрагента")=Неопределено Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.ПодписантОтКонтрагента.ПараметрыВыбора, "Отбор.ПодразделениеКомпании", Объект.ПодразделениеКомпании);
		КонецЕсли;
	КонецЕсли;
	
	// устанавливаем отбор по контрагенту
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Если Не Элементы.Найти("ПодписантОтОрганизации")=Неопределено Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.ПодписантОтОрганизации.ПараметрыВыбора, "Отбор.Контрагент", Объект.Владелец);
		КонецЕсли;
		Если Не Элементы.Найти("ПодписантОтКонтрагента")=Неопределено Тогда
			УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.ПодписантОтКонтрагента.ПараметрыВыбора, "Отбор.Контрагент", Объект.Владелец);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомСправочникаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	ЭтоКомиссия = (Объект.ВидДоговора=Перечисления.ВидыДоговоров.СКомитентом) ИЛИ (Объект.ВидДоговора=Перечисления.ВидыДоговоров.СКомиссионером);
	Элементы.ТипСуммыКомиссии.Доступность                   = ЭтоКомиссия;
	Элементы.ПроцентКомиссионногоВознаграждения.Доступность = ЭтоКомиссия;
	Элементы.СуммаКомиссионногоВознаграждения.Доступность   = ЭтоКомиссия;
	Элементы.КомиссияОтчетНаОснованииПродаж.Доступность     = ЭтоКомиссия;
	Если Объект.ТипСуммыКомиссии = 0 Тогда
		Элементы.СуммаКомиссионногоВознаграждения.Видимость = Ложь;
		Элементы.ПроцентКомиссионногоВознаграждения.Видимость = Истина;
	ИначеЕсли Объект.ТипСуммыКомиссии = 1 Тогда
		Элементы.СуммаКомиссионногоВознаграждения.Видимость = Истина;
		Элементы.ПроцентКомиссионногоВознаграждения.Видимость = Ложь;
	КонецЕсли;
	
	// Обновляем заголовок индикатора состояния договора с контрагентом
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УстановитьПривилегированныйРежим(Истина);
		ЗащищенныеФункцииСервер.УстановитьЗаголовокНадписиВзаиморасчеты(ЭтотОбъект);
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		Элементы.НадписьВзаиморасчеты.Заголовок = "";
	КонецЕсли;
	
	Элементы.АвтоЗакрытиеСделок.ТолькоПросмотр = НЕ ПравоПользователя("РедактированиеФлагаАвтоматическоеЗакрытиеСделок", Объект);
		
	Элементы.МаксимальныйКредит.Доступность = (НЕ Объект.ОтменаКонтроляСуммыКредита);
	
	НеВиртуальныйДоговор = (НЕ Объект.ТипДоговора = Перечисления.ТипыДоговоров.ВиртуальныйДоговор);
	
	Элементы.ДатаНачала.Доступность    = НеВиртуальныйДоговор;
	Элементы.ДатаКонца.Доступность     = НеВиртуальныйДоговор;
	Элементы.НомерДоговора.Доступность = НеВиртуальныйДоговор;
	
	ДостСрокПоставки = Истина;
	
	Если Объект.Владелец.ВидКонтрагента <> Перечисления.ВидыКонтрагентов.Поставщик Тогда
		ДостСрокПоставки = Ложь;
		Если НЕ Объект.СрокПоставки=0 Тогда
			Объект.СрокПоставки = 0;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.СрокПоставки.Видимость = ДостСрокПоставки;
	Элементы.ГруппаДанныеПоставщика.Доступность = ЗначениеЗаполнено(Объект.ПризнакАгента);
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия.
	УправлениеДиалогомСправочникаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Проверим, участвует ли объект в движениях
	НеобходимостьБлокировки = ОбработкаСобытийОбъектаСервер.ПроверитьИспользованиеСсылки(Объект.Ссылка,"РегистрНакопления.ВзаиморасчетыКомпании","ДоговорВзаиморасчетов");
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	СписокРеквизитов.Добавить("Владелец",             "Владелец",              НеобходимостьБлокировки);
	СписокРеквизитов.Добавить("ВидДоговора",          "ВидДоговора",           НеобходимостьБлокировки);
	СписокРеквизитов.Добавить("Организация",          "Организация",           НеобходимостьБлокировки);
	СписокРеквизитов.Добавить("ПодразделениеКомпании","ПодразделениеКомпании", НеобходимостьБлокировки);
	СписокРеквизитов.Добавить("ВалютаВзаиморасчетов", "ВалютаВзаиморасчетов",  НеобходимостьБлокировки);
	СписокРеквизитов.Добавить("СпособЗакрытияСделок", "СпособЗакрытияСделок",  НеобходимостьБлокировки);
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);

	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Подключаемый обработчик, вызывающий общую процедуру для обработки команды панели действий.
// 
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомСправочникаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Организация" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Справочники.ДоговорыВзаиморасчетов.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОрганизацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Организация".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Подразделение" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура ПодразделениеКомпанииПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Справочники.ДоговорыВзаиморасчетов.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПодразделениеПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Подразделение".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПодразделениеКомпанииПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПодразделениеКомпанииПриИзмененииНаСервере();
	
КонецПроцедуры // ПодразделениеПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата начала" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура ДатаНачалаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата начала".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ДатаНачалаПриИзмененииНаСервере();
	
КонецПроцедуры // ДатаНачалаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Валюта взаиморасчетов" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура ВалютаВзаиморасчетовПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
КонецПроцедуры // ВалютаВзаиморасчетовПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Валюта взаиморасчетов".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ВалютаВзаиморасчетовПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ВалютаВзаиморасчетовПриИзмененииНаСервере();
	
КонецПроцедуры // ВалютаВзаиморасчетовПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номер договора" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура НомерДоговораПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
КонецПроцедуры // НомерДоговораПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номер договора".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	НомерДоговораПриИзмененииНаСервере();
	
КонецПроцедуры // НомерДоговораПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Вид договора" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	НастроитьПараметрыВыбораЭлементовФормы();

КонецПроцедуры // ВалютаВзаиморасчетовПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Вид договора".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ВидДоговораПриИзмененииНаСервере();
	
КонецПроцедуры // ВидДоговораПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Тип договора" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура ТипДоговораПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	СформироватьНаименованиеПоУмолчанию(ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ТипДоговораПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Тип договора".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТипДоговораПриИзменении(Элемент)
	
	ТипДоговораПриИзмененииНаСервере();
	
КонецПроцедуры // ТипДоговораПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Основной" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Функция УстановитьОсновнойДоговорНаСервере(ПараметрыДействия=Неопределено)
	
	// Проверим, а нет ли уже основного договора с такими же аналитиками.
	Возврат Справочники.ДоговорыВзаиморасчетов.ПроверитьОсновнойДоговор(Объект);
	
КонецФункции // ОсновнойПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Основной".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ОсновнойПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	Если Объект.Основной Тогда
		ОсновнойДоговор = УстановитьОсновнойДоговорНаСервере();
		Если НЕ ОсновнойДоговор = ПредопределенноеЗначение("Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка") Тогда
			
			// Формируем описание обработчика перехвата закрытия формы
			ОбработчикВопроса = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияОсновнойДоговор", ЭтотОбъект);
			
			// Формируем текст вопроса
			ТекстВопроса = НСтр("ru = 'Для выбранных аналитик(организация, подразделение, вид договора) основной договор уже назначен """ + ОсновнойДоговор + """. Продолжить?'");
			
			// Получаем подтверждение операции от пользователя
			ПоказатьВопрос(ОбработчикВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //ОсновнойПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Тип суммы комиссии" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура ТипСуммыКомиссииПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Справочники.ДоговорыВзаиморасчетов.ТипСуммыКомиссииПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ВалютаВзаиморасчетовПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Тип суммы комиссии".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТипСуммыКомиссииПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТипСуммыКомиссииПриИзмененииНаСервере();
	
КонецПроцедуры // ВидДоговораПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Владелец".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	НастроитьПараметрыВыбораЭлементовФормы();
	
КонецПроцедуры // ВладелецПриИзменении()

&НаСервере
Процедура ОтменаКонтроляСуммыКредитаПриИзмененииНаСервере()
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОтменаКонтроляСуммыКредитаПриИзмененииНаСервере()

&НаКлиенте
Процедура ОтменаКонтроляСуммыКредитаПриИзменении(Элемент)
	
	ОтменаКонтроляСуммыКредитаПриИзмененииНаСервере();
	
КонецПроцедуры // ОтменаКонтроляСуммыКредитаПриИзменении()

// Обработчик события возникающего на клиенте при обработке выбора данных реквизита "Наименование".
//
// Параметры:
//  Элемент              - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбранноеЗначение    - Выбранное значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура НаименованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	КэшНаименование = ВыбранноеЗначение;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "ПроцентПредоплатыИзНастроек".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПроцентПредоплатыИзНастроекПриИзменении(Элемент)
	ПроцентПредоплатыВручную = НЕ ПроцентПредоплатыИзНастроек;
	Элементы.ПолеПроцентПредоплаты.ТолькоПросмотр = ?(ПроцентПредоплатыИзНастроек, Истина, Ложь);
	Объект.ПроцентПредоплаты = ?(ПроцентПредоплатыИзНастроек, -1, ПолеПроцентПредоплаты);
КонецПроцедуры // ПроцентПредоплатыИзНастроекПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ПроцентПредоплатыВручную".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПроцентПредоплатыВручнуюПриИзменении(Элемент)
	ПроцентПредоплатыИзНастроек = НЕ ПроцентПредоплатыВручную;
	Элементы.ПолеПроцентПредоплаты.ТолькоПросмотр = ?(НЕ ПроцентПредоплатыВручную, Истина, Ложь);
	Объект.ПроцентПредоплаты = ?(НЕ ПроцентПредоплатыВручную, -1, ПолеПроцентПредоплаты);
КонецПроцедуры // ПроцентПредоплатыВручнуюПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ПолеПроцентПредоплаты".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПолеПроцентПредоплатыПриИзменении(Элемент)
	Объект.ПроцентПредоплаты = ПолеПроцентПредоплаты;
КонецПроцедуры // ПолеПроцентПредоплатыПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Признак агента" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура ПризнакАгентаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	Элементы.ТелефонПоставщика.СписокВыбора.Очистить();	
	Если ЗначениеЗаполнено(Объект.ПризнакАгента) Тогда
		
		Владелец = Объект.Владелец;
		Объект.ИННПоставщика = Владелец.ИНН;
		Объект.НаименованиеПоставщика = Владелец.Наименование;
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Владелец);
		
		КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов,, Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		
		Если КонтактнаяИнформацияОбъекта.Количество() > 0 Тогда
			Объект.ТелефонПоставщика = КонтактнаяИнформацияОбъекта[0].Представление;
			Для Каждого Строка Из КонтактнаяИнформацияОбъекта Цикл
				Элементы.ТелефонПоставщика.СписокВыбора.Добавить(Строка.Представление);
			КонецЦикла;
		КонецЕсли;
		
	Иначе
		
		Объект.ИННПоставщика = "";
		Объект.НаименованиеПоставщика = "";
		Объект.ТелефонПоставщика = "";
		
	КонецЕсли;

	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ВалютаВзаиморасчетовПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Признак агента".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ПризнакАгентаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПризнакАгентаПриИзмененииНаСервере();
	
КонецПроцедуры //ПризнакАгентаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при нажатии на надпись "Взаиморасчеты".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьВзаиморасчетыНажатие(Элемент)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.НадписьВзаиморасчетыНажатие(ЭтотОбъект);
	
КонецПроцедуры // НадписьВзаиморасчетыНажатие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	СформироватьНаименованиеПоУмолчанию();
	КэшНаименование = Справочники.ДоговорыВзаиморасчетов.СформироватьНаименованиеПоУмолчанию(Объект);
	
	НастроитьГруппуПроцентПредоплаты();
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;

	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомСправочникаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - СправочникОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	 	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево           - Признак отказа от создания формы.
//  ТекущийОбъект   - СправочникОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура        - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОсновнойДоговор = ПредопределенноеЗначение("Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка") Тогда
		ДоговорОбъект = ОсновнойДоговор.ПолучитьОбъект();
		ДоговорОбъект.Основной = Ложь;
		ДоговорОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - СправочникОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура        - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	  	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомСправочникаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомСправочникаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);

КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомСправочникаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
